Revit 2027 API
DatumEnds Enumeration
 An enumerated type representing ends of a datum plane.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum DatumEnds
Public Enumeration DatumEnds
public enum class DatumEnds
type DatumEnds
Members
Member name | Value | Description
End0 | 0 |  The start point of the datum plane in the view.
End1 | 1 |  The end point of the datum plane in the view.
See Also
Reference
Autodesk.Revit.DB Namespace